{
  "About site": "О сайте",
  "About site Description": "На этой странице представлена информация о сайте, технологиях и инструментах, котороые использовались во время разработки, а также, какие возможновсти имеет данное приложение.",
  "Design": "Дизайн",
  "Design description": "Дизайн приложения реализован в двух вариантах: старый и новый. Для переключения в коде используются Feature Flags. Также, при необходимости, можно удалить старый или новый дизайн из кода, используя специальный скрипт для удаления фичей.",
  "Design connection": "Для переключения дизайна авторизуйтесь на сайте, используя логин и пароль, который представлен ниже. Переключение дизайна находится во вкладке \"Настройки пользователя\".\n",
  "login": "Логин: user",
  "password": "Пароль: 123",
  "Internationalisation": "Интернационализация",
  "Internationalisation description": "Сайт представлен в двух языках: русский и английский. Для переводов используется библиотека i18next.",
  "Articles": "Статьи",
  "Articles description": "Страница со статьями имеет демонстрационных характер и показывает возможности сайта. Текст статей скопирован из интернета и несет демонстративный характер. В разделе статьи используется фильтрация по названию и типу статьи, также имеется сортировка статей. Фильтрация реализована на стороне сервера. Также в поиске используется хук useDebounce для предотвращения частых запросов на сервер. ",
  "Articles scroll": "Страница имеет бесконечную ленту. Для загрузки новых статей используется хук useInfiniteScroll",
  "Design theme": "Также сайт имеет три цветовых схемы, как для старого дизайна, так и для нового. Архитектура проекта реализована таким образом, чтобы можно легко удалить или добавить новую цветовую схему. Для изменения темы используется ThemeProvider и хук useTheme",
  "URLSearchParams": "Для работы со URL строкой используется URLSearchParams. Таким образом, на странице имеется возможность поделиться ссылкой, сохранив параметры фильтраций.",
  "Scrolling": "Скроллинг",
  "Scrolling description": "Страницы сайта имеют возможность сохранения позиции скролла при возвращении на страницу, например страницу статей. Для реализации функционала используется хук useThrottle.",
  "Users": "Пользователи",
  "Users description": "У пользователей имеются различные роли: ADMIN, MANAGER, USER. У каждой роли есть различные доступы, в частности, у пользователя с ролями ADMIN или MANAGER есть доступ к админ панели.",
  "Users settings": "Пользователь имеет настройки на стороне сервера (JSON Settings): тема, дизайн и первый визит. Данные настройки определяют, какой дизайн и какую цветовую тему отобразить на любом устройстве пользователя.",
  "Profile settings": "Во вкладке \"Профиль\" находятся информация о пользователе и возможность изменять данные. Также имеется возможность посещения страницы профиля других пользователей, при этом страницы будут защищены от редактирования.",
  "Server": "Сервер",
  "Server description": "Для работы с данными и реализации запросов на сайте используется фейковый сервер - json-server. Для запросов на сервер используется Redux Toolkit, RTK Query и Axios."
}
